Repository: stonches1/budgetpulse
Catalog: BudgetPulse/Localizable.xcstrings
Source language: en
Languages: es, fr, pt

# insight_spending_down
source: Your spending is down %d%% compared to last period. Keep it up!
es: Tu gasto disminuyó %d%% comparado con el período anterior. ¡Sigue así!
fr: Vos dépenses ont diminué de %d%% par rapport à la période précédente. Continuez !
pt: Seus gastos diminuíram %d%% em comparação com o período anterior. Continue assim!

# insight_spending_up
source: Your spending is up %d%% compared to last period.
es: Tu gasto aumentó %d%% comparado con el período anterior.
fr: Vos dépenses ont augmenté de %d%% par rapport à la période précédente.
pt: Seus gastos aumentaram %d%% em comparação com o período anterior.

# insight_top_category
source: Your top spending category is %@ at %d%% of total spending.
es: Tu categoría de mayor gasto es %@ con %d%% del gasto total.
fr: Votre catégorie de dépenses principale est %@ avec %d%% des dépenses totales.
pt: Sua principal categoria de gastos é %@ com %d%% do gasto total.

source: Insights
es: Información
fr: Aperçus

# is_recurring
source: Recurring
es: Recurrente
fr: Récurrent
pt: Recorrente

source: items
es: elementos
fr: éléments
pt: itens

source: Language
es: Idioma
fr: Langue
pt: Idioma

# language_english
source: English
es: Inglés
fr: Anglais
pt: Inglês

# language_french
source: French
es: Francés
fr: Français
pt: Francês

# language_portuguese
source: Portuguese
es: Portugués
fr: Portugais
pt: Português

# language_spanish
source: Spanish
es: Español
fr: Espagnol
pt: Espanhol

# language_system
source: System Language
es: Idioma del sistema
fr: Langue système
pt: Idioma do sistema

# last_updated
source: Last updated: January 2025
es: Última actualización: Enero 2025
fr: Dernière mise à jour: Janvier 2025
pt: Última atualização: Janeiro 2025

source: Last 3 Months
es: Últimos 3 meses
fr: 3 derniers mois
pt: Últimos 3 meses

source: Last 6 Months
es: Últimos 6 meses
fr: 6 derniers mois
pt: Últimos 6 meses

source: Last Month
es: Mes pasado
fr: Mois dernier
pt: Mês passado

source: limits set
es: límites establecidos
fr: limites définies
pt: limites definidos

source: Loading...
es: Cargando...
fr: Chargement...
pt: Carregando...

# loading_products
source: Loading subscription options...
es: Cargando opciones de suscripción...
fr: Chargement des options d'abonnement...
pt: Carregando opções de assinatura...

source: Mark Paid
es: Marcar pagado
fr: Marquer payé
pt: Marcar pago

source: mo
es: mes
fr: mois
pt: mês

source: Month
es: Mes
fr: Mois
pt: Mês

# month_abbr
source: mo
es: mes
fr: mois
pt: mês

source: Monthly Breakdown
es: Desglose mensual
fr: Répartition mensuelle
pt: Detalhamento mensal

source: Monthly Budget
es: Presupuesto mensual
fr: Budget mensuel
pt: Orçamento mensal

source: Monthly Cost
es: Costo Mensual
fr: Coût Mensuel
pt: Custo Mensal

source: Monthly History
es: Historial mensual
fr: Historique mensuel
pt: Histórico mensal

source: Monthly Limit
es: Límite mensual
fr: Limite mensuelle
pt: Limite mensal

# monthly_spending
source: Monthly
es: Mensual
fr: Mensuel
pt: Mensal

# monthly_subscriptions_total
source: Monthly Total
es: Total mensual
fr: Total mensuel
pt: Total mensal

source: Monthly
es: Mensual
fr: Mensuel
pt: Mensal

source: more
es: más
fr: plus
pt: mais

source: Net Balance
es: Balance neto
fr: Solde net
pt: Saldo líquido

source: Next Billing Date
es: Próxima Fecha de Cobro
fr: Prochaine Date de Facturation
pt: Próxima Data de Cobrança

source: No data available
es: No hay datos disponibles
fr: Aucune donnée disponible
pt: Nenhum dado disponível

source: No expenses yet
es: Aún no hay gastos
fr: Pas encore de dépenses
pt: Nenhuma despesa ainda

# no_goals_description
source: Add a savings goal to start tracking
es: Añade una meta de ahorro para empezar
fr: Ajoutez un objectif d'épargne pour commencer
pt: Adicione uma meta de poupança para começar

source: No goals yet
es: Aún no hay metas
fr: Pas encore d'objectifs
pt: Nenhuma meta ainda

# no_history
source: No history yet
es: Sin historial aún
fr: Pas encore d'historique
pt: Nenhum histórico ainda

# no_history_description
source: Start adding expenses to see your history
es: Empieza a añadir gastos para ver tu historial
fr: Commencez à ajouter des dépenses pour voir votre historique
pt: Comece a adicionar despesas para ver seu histórico

# no_income_description
source: Add your first income to start tracking
es: Añade tu primer ingreso para empezar a rastrear
fr: Ajoutez votre premier revenu pour commencer
pt: Adicione sua primeira receita para começar

source: No income yet
es: Aún no hay ingresos
fr: Pas encore de revenus
pt: Nenhuma receita ainda

# no_insights_yet
source: Add more expenses to see insights
es: Añade más gastos para ver información
fr: Ajoutez plus de dépenses pour voir les aperçus
pt: Adicione mais despesas para ver insights

# no_limit_set
source: No limit
es: Sin límite
fr: Pas de limite
pt: Sem limite

# no_payment_now
source: No payment required now
es: No se requiere pago ahora
fr: Aucun paiement requis maintenant
pt: Nenhum pagamento necessário agora

# no_recurring_description
source: Add recurring expenses to track subscriptions
es: Añade gastos recurrentes para rastrear suscripciones
fr: Ajoutez des dépenses récurrentes pour suivre vos abonnements
pt: Adicione despesas recorrentes para rastrear assinaturas

source: No recurring expenses
es: Sin gastos recurrentes
fr: Pas de dépenses récurrentes
pt: Sem despesas recorrentes

source: No results
es: Sin resultados
fr: Aucun résultat
pt: Nenhum resultado

# no_results_description
source: Try adjusting your search or filters
es: Intenta ajustar tu búsqueda o filtros
fr: Essayez d'ajuster votre recherche ou vos filtres
pt: Tente ajustar sua busca ou filtros

source: No Subscriptions
es: Sin Suscripciones
fr: Aucun Abonnement
pt: Sem Assinaturas

source: Not available
es: No disponible
fr: Non disponible
pt: Não disponível

source: Notes
es: Notas
pt: Notas

source: Notes (optional)
es: Notas (opcional)
fr: Notes (optionnel)
pt: Notas (opcional)

# notes_placeholder
source: Optional notes...
es: Notas opcionales...
fr: Notes optionnelles...
pt: Notas opcionais...

# notification_bill_due_body
source: %@ (%@) is due tomorrow
es: %@ (%@) vence mañana
fr: %@ (%@) est dû demain
pt: %@ (%@) vence amanhã

# notification_bill_due_title
source: Bill Due Tomorrow
es: Factura vence mañana
fr: Facture due demain
pt: Conta vence amanhã

# notification_budget_alert_body
source: You've used %d%% of your budget. %@ remaining.
es: Has usado el %d%% de tu presupuesto. Quedan %@.
fr: Vous avez utilisé %d%% de votre budget. %@ restants.
pt: Você usou %d%% do seu orçamento. %@ restante.

# notification_budget_alert_title
source: Budget Alert
es: Alerta de presupuesto
fr: Alerte budget
pt: Alerta de orçamento

# notification_budget_exceeded_body
source: You've exceeded your monthly budget!
es: ¡Has excedido tu presupuesto mensual!
fr: Vous avez dépassé votre budget mensuel !
pt: Você excedeu seu orçamento mensal!

# notification_daily_reminder_body
source: Don't forget to log your expenses today!
es: ¡No olvides registrar tus gastos hoy!
fr: N'oubliez pas d'enregistrer vos dépenses aujourd'hui !
pt: Não esqueça de registrar suas despesas hoje!

# notification_daily_reminder_title
source: Daily Expense Reminder
es: Recordatorio diario de gastos
fr: Rappel quotidien des dépenses
pt: Lembrete diário de despesas

# notification_permission_message
source: Please enable notifications in Settings to receive alerts
es: Por favor, activa las notificaciones en Ajustes para recibir alertas
fr: Veuillez activer les notifications dans les Réglages pour recevoir des alertes
pt: Por favor, ative as notificações em Ajustes para receber alertas

# notification_permission_title
source: Notifications Disabled
es: Notificaciones desactivadas
fr: Notifications désactivées
pt: Notificações desativadas

source: Notifications
es: Notificaciones
pt: Notificações

# notifications_footer
source: Budget alerts notify you at 75%, 90%, and 100% of your limit
es: Las alertas de presupuesto te notifican al 75%, 90% y 100% de tu límite
fr: Les alertes de budget vous notifient à 75%, 90% et 100% de votre limite
pt: Alertas de orçamento notificam você em 75%, 90% e 100% do seu limite

source: of
es: de
fr: sur
pt: de

source: of total
es: del total
fr: du total
pt: do total

# onboarding_back
source: Back
es: Atrás
fr: Retour
pt: Voltar

# onboarding_budget_description
source: Set a monthly spending limit to help you stay on track.
es: Establece un límite de gasto mensual para ayudarte a mantenerte en el buen camino.
fr: Définissez une limite de dépenses mensuelle pour vous aider à rester sur la bonne voie.
pt: Defina um limite de gastos mensal para ajudá-lo a manter o controle.

# onboarding_budget_hint
source: You can change this anytime in Settings
es: Puedes cambiar esto en cualquier momento en Ajustes
fr: Vous pouvez modifier cela à tout moment dans les Paramètres
pt: Você pode alterar isso a qualquer momento nas Configurações

# onboarding_currency_description
source: Select the currency you'll use to track your expenses.
es: Selecciona la moneda que usarás para seguir tus gastos.
fr: Sélectionnez la devise que vous utiliserez pour suivre vos dépenses.
pt: Selecione a moeda que você usará para acompanhar suas despesas.

# onboarding_feature_budget
source: Set Budgets
es: Establecer presupuestos
fr: Définir des budgets
pt: Definir orçamentos

# onboarding_feature_budget_desc
source: Create monthly limits and track your progress
es: Crea límites mensuales y sigue tu progreso
fr: Créez des limites mensuelles et suivez vos progrès
pt: Crie limites mensais e acompanhe seu progresso

# onboarding_feature_languages
source: Multiple Languages
es: Varios idiomas
fr: Plusieurs langues
pt: Vários idiomas

# onboarding_feature_languages_desc
source: Use the app in English, French, Spanish, or Portuguese
es: Usa la app en inglés, francés, español o portugués
fr: Utilisez l'app en anglais, français, espagnol ou portugais
pt: Use o app em inglês, francês, espanhol ou português

# onboarding_feature_track
source: Track Expenses
es: Seguir gastos
fr: Suivre les dépenses
pt: Acompanhar despesas

# onboarding_feature_track_desc
source: Log your daily spending quickly and easily
es: Registra tus gastos diarios rápida y fácilmente
fr: Enregistrez vos dépenses quotidiennes rapidement
pt: Registre seus gastos diários de forma rápida e fácil

# onboarding_get_started
source: Get Started
es: Empezar
fr: Commencer
pt: Começar

# onboarding_language_description
source: Select your preferred language for the app. You can change this later in Settings.
es: Selecciona tu idioma preferido. Puedes cambiarlo más tarde en Ajustes.
fr: Sélectionnez votre langue préférée. Vous pouvez la modifier plus tard dans les Paramètres.
pt: Selecione seu idioma preferido. Você pode alterar isso mais tarde nas Configurações.

# onboarding_next
source: Next
es: Siguiente
fr: Suivant
pt: Próximo

# onboarding_select_currency
source: Choose Your Currency
es: Elige tu moneda
fr: Choisissez votre devise
pt: Escolha sua moeda

# onboarding_select_language
source: Choose Your Language
es: Elige tu idioma
fr: Choisissez votre langue
pt: Escolha seu idioma

# onboarding_set_budget
source: Set Your Budget
es: Establece tu presupuesto
fr: Définissez votre budget
pt: Defina seu orçamento

source: Open Settings
es: Abrir Ajustes
fr: Ouvrir les Réglages
pt: Abrir Ajustes

source: Over Budget!
es: ¡Presupuesto excedido!
fr: Budget dépassé !
pt: Orçamento excedido!

source: Overdue
es: Vencido
fr: En Retard
pt: Atrasado

source: Pause
es: Pausar
fr: Mettre en Pause
pt: Pausar

source: Pause Subscription
es: Pausar Suscripción
fr: Mettre l'Abonnement en Pause
pt: Pausar Assinatura

source: Paused
es: Pausado
fr: En Pause
pt: Pausado

source: Paused Subscriptions
es: Suscripciones Pausadas
fr: Abonnements en Pause
pt: Assinaturas Pausadas

source: Payment Reminder
es: Recordatorio de Pago
fr: Rappel de Paiement
pt: Lembrete de Pagamento

# per_month
source: /month
es: /mes
fr: /mois
pt: /mês

source: per year
es: por año
fr: par an
pt: por ano

source: Period
es: Período
fr: Période
pt: Período

source: Premium Active
es: Premium Activo
fr: Premium Actif
pt: Premium Ativo

source: Premium Features
es: Funciones Premium
fr: Fonctionnalités Premium
pt: Recursos Premium

source: Premium Required
es: Se Requiere Premium
fr: Premium Requis
pt: Premium Necessário

# premium_subtitle
source: Unlock all features and take control of your finances
es: Desbloquea todas las funciones y toma el control de tus finanzas
fr: Débloquez toutes les fonctionnalités et prenez le contrôle de vos finances
pt: Desbloqueie todos os recursos e assuma o controle de suas finanças

# premium_thanks
source: Thank you for your support!
es: ¡Gracias por tu apoyo!
fr: Merci pour votre soutien !
pt: Obrigado pelo seu apoio!

# premium_unlock_feature
source: Upgrade to Premium to unlock %@
es: Actualiza a Premium para desbloquear %@
fr: Passez à Premium pour débloquer %@
pt: Atualize para Premium para desbloquear %@

source: Preset Filters
es: Filtros predefinidos
fr: Filtres prédéfinis
pt: Filtros predefinidos

source: Previous
es: Anterior
fr: Précédent
pt: Anterior

source: Privacy Policy
es: Política de Privacidad
fr: Politique de Confidentialité
pt: Política de Privacidade

# privacy_contact_content
source: If you have questions about this Privacy Policy, please contact us at support@budgetpulse.app
es: Si tienes preguntas sobre esta Política de Privacidad, contáctanos en support@budgetpulse.app
fr: Si vous avez des questions concernant cette Politique de Confidentialité, contactez-nous à support@budgetpulse.app
pt: Se você tiver dúvidas sobre esta Política de Privacidade, entre em contato conosco em support@budgetpulse.app

# privacy_section_1_title
source: Information We Collect
es: Información que Recopilamos
fr: Informations que Nous Collectons
pt: Informações que Coletamos

# privacy_section_1_content
source: BudgetPulse stores all your financial data locally on your device. We do not collect, transmit, or store your personal financial information on our servers. Your expense records, budget settings, and financial goals remain entirely on your device.
es: BudgetPulse almacena todos tus datos financieros localmente en tu dispositivo. No recopilamos, transmitimos ni almacenamos tu información financiera personal en nuestros servidores. Tus registros de gastos, configuraciones de presupuesto y metas financieras permanecen completamente en tu dispositivo.
fr: BudgetPulse stocke toutes vos données financières localement sur votre appareil. Nous ne collectons, transmettons ni stockons vos informations financières personnelles sur nos serveurs. Vos enregistrements de dépenses, paramètres de budget et objectifs financiers restent entièrement sur votre appareil.
pt: BudgetPulse armazena todos os seus dados financeiros localmente no seu dispositivo. Não coletamos, transmitimos ou armazenamos suas informações financeiras pessoais em nossos servidores. Seus registros de despesas, configurações de orçamento e metas financeiras permanecem inteiramente no seu dispositivo.

# privacy_section_2_title
source: Data Storage
es: Almacenamiento de Datos
fr: Stockage des Données
pt: Armazenamento de Dados

# privacy_section_2_content
source: All data is stored securely on your device using Apple's secure storage mechanisms. If you enable iCloud backup on your device, your app data may be included in your device backup. We recommend enabling device passcode and Face ID/Touch ID for additional security.
es: Todos los datos se almacenan de forma segura en tu dispositivo utilizando los mecanismos de almacenamiento seguro de Apple. Si habilitas la copia de seguridad de iCloud en tu dispositivo, los datos de la app pueden incluirse en la copia de seguridad. Recomendamos habilitar el código de acceso y Face ID/Touch ID para mayor seguridad.
fr: Toutes les données sont stockées en toute sécurité sur votre appareil en utilisant les mécanismes de stockage sécurisé d'Apple. Si vous activez la sauvegarde iCloud sur votre appareil, les données de l'application peuvent être incluses dans votre sauvegarde. Nous recommandons d'activer le code d'accès et Face ID/Touch ID pour une sécurité supplémentaire.
pt: Todos os dados são armazenados com segurança no seu dispositivo usando os mecanismos de armazenamento seguro da Apple. Se você habilitar o backup do iCloud no seu dispositivo, os dados do app podem ser incluídos no backup. Recomendamos habilitar o código de acesso e Face ID/Touch ID para segurança adicional.

# privacy_section_3_title
source: Subscriptions
es: Suscripciones
fr: Abonnements
pt: Assinaturas

# privacy_section_3_content
source: Premium subscriptions are processed through Apple's App Store. We do not have access to your payment information. Apple handles all payment processing according to their privacy policy.
es: Las suscripciones premium se procesan a través de la App Store de Apple. No tenemos acceso a tu información de pago. Apple maneja todo el procesamiento de pagos según su política de privacidad.
fr: Les abonnements premium sont traités via l'App Store d'Apple. Nous n'avons pas accès à vos informations de paiement. Apple gère tout le traitement des paiements conformément à sa politique de confidentialité.
pt: As assinaturas premium são processadas através da App Store da Apple. Não temos acesso às suas informações de pagamento. A Apple lida com todo o processamento de pagamentos de acordo com sua política de privacidade.

# privacy_section_4_title
source: Analytics
es: Analíticas
fr: Analytiques
pt: Análises

# privacy_section_4_content
source: We may collect anonymous usage statistics to improve the app experience. This data does not include any personal or financial information and cannot be used to identify you.
es: Podemos recopilar estadísticas de uso anónimas para mejorar la experiencia de la app. Estos datos no incluyen información personal o financiera y no pueden usarse para identificarte.
fr: Nous pouvons collecter des statistiques d'utilisation anonymes pour améliorer l'expérience de l'application. Ces données n'incluent aucune information personnelle ou financière et ne peuvent pas être utilisées pour vous identifier.
pt: Podemos coletar estatísticas de uso anônimas para melhorar a experiência do app. Esses dados não incluem informações pessoais ou financeiras e não podem ser usados para identificá-lo.

# privacy_section_5_title
source: Your Rights
es: Tus Derechos
fr: Vos Droits
pt: Seus Direitos

# privacy_section_5_content
source: You can delete all your data at any time by using the 'Reset All Data' option in Settings, or by uninstalling the app. Since your data is stored locally, deleting the app will remove all your information.
es: Puedes eliminar todos tus datos en cualquier momento usando la opción 'Restablecer todos los datos' en Ajustes, o desinstalando la app. Como tus datos se almacenan localmente, eliminar la app eliminará toda tu información.
fr: Vous pouvez supprimer toutes vos données à tout moment en utilisant l'option 'Réinitialiser toutes les données' dans les Paramètres, ou en désinstallant l'application. Comme vos données sont stockées localement, la suppression de l'application supprimera toutes vos informations.
pt: Você pode excluir todos os seus dados a qualquer momento usando a opção 'Redefinir todos os dados' nas Configurações, ou desinstalando o app. Como seus dados são armazenados localmente, excluir o app removerá todas as suas informações.

# purchase_failed
source: Purchase failed. Please try again.
es: La compra falló. Por favor, inténtalo de nuevo.
fr: L'achat a échoué. Veuillez réessayer.
pt: A compra falhou. Por favor, tente novamente.

source: Receipt
es: Recibo
fr: Reçu
pt: Recibo

source: Receipt not found
es: Recibo no encontrado
fr: Reçu introuvable
pt: Recibo não encontrado

# receipt_premium_feature
source: Add receipt photos
es: Agregar fotos de recibos
fr: Ajouter des photos de reçus
pt: Adicionar fotos de recibos

source: Recent Expenses
es: Gastos recientes
fr: Dépenses récentes
pt: Despesas recentes

source: Record Payment
es: Registrar Pago
fr: Enregistrer le Paiement
pt: Registrar Pagamento

# recurrence_biweekly
source: Biweekly
es: Quincenal
fr: Bimensuel
pt: Quinzenal

# recurrence_monthly
source: Monthly
es: Mensual
fr: Mensuel
pt: Mensal

# recurrence_type
source: Frequency
es: Frecuencia
fr: Fréquence
pt: Frequência

# recurrence_weekly
source: Weekly
es: Semanal
fr: Hebdomadaire
pt: Semanal

# recurrence_yearly
source: Yearly
es: Anual
fr: Annuel
pt: Anual

source: Rate App
es: Calificar App
fr: Évaluer l'app
pt: Avaliar App

# recurring_expense_footer
source: Recurring expenses help track subscriptions and bills
es: Los gastos recurrentes ayudan a rastrear suscripciones y facturas
fr: Les dépenses récurrentes aident à suivre les abonnements et factures
pt: Despesas recorrentes ajudam a rastrear assinaturas e contas

source: Recurring Expenses
es: Gastos recurrentes
fr: Dépenses récurrentes
pt: Despesas recorrentes

source: Remaining
es: Restante
fr: Restant
pt: Restante

source: Reminder Time
es: Hora del recordatorio
fr: Heure du rappel
pt: Hora do lembrete

source: Remove Receipt
es: Eliminar recibo
fr: Supprimer le reçu
pt: Remover recibo

source: Reports
es: Informes
fr: Rapports
pt: Relatórios

# reports_benefit_1
source: Detailed spending breakdown by category
es: Desglose detallado de gastos por categoría
fr: Répartition détaillée des dépenses par catégorie
pt: Detalhamento de gastos por categoria

# reports_benefit_2
source: Monthly spending comparison charts
es: Gráficos de comparación de gastos mensuales
fr: Graphiques de comparaison des dépenses mensuelles
pt: Gráficos de comparação de gastos mensais

# reports_benefit_3
source: Smart insights to improve your spending
es: Consejos inteligentes para mejorar tus gastos
fr: Conseils intelligents pour améliorer vos dépenses
pt: Dicas inteligentes para melhorar seus gastos

# reports_benefit_4
source: Track trends over time periods
es: Seguimiento de tendencias a lo largo del tiempo
fr: Suivez les tendances sur différentes périodes
pt: Acompanhe tendências ao longo do tempo

source: Reset
es: Restablecer
fr: Réinitialiser
pt: Redefinir

source: Reset All Data
es: Restablecer todos los datos
fr: Réinitialiser toutes les données
pt: Redefinir todos os dados

# reset_data_message
source: This will permanently delete all expenses and reset your budget. This action cannot be undone.
es: Esto eliminará permanentemente todos los gastos y restablecerá tu presupuesto. Esta acción no se puede deshacer.
fr: Cela supprimera définitivement toutes les dépenses et réinitialisera votre budget. Cette action est irréversible.
pt: Isso excluirá permanentemente todas as despesas e redefinirá seu orçamento. Esta ação não pode ser desfeita.

# reset_data_title
source: Reset All Data?
es: ¿Restablecer todos los datos?
fr: Réinitialiser toutes les données ?
pt: Redefinir todos os dados?

source: Reset Onboarding
es: Reiniciar introducción
fr: Réinitialiser l'introduction
pt: Reiniciar introdução

# reset_onboarding_message
source: This will show the welcome screens again on next launch.
es: Esto mostrará las pantallas de bienvenida de nuevo en el próximo inicio.
fr: Cela affichera à nouveau les écrans de bienvenue au prochain lancement.
pt: Isso mostrará as telas de boas-vindas novamente na próxima inicialização.

# reset_onboarding_title
source: Reset Onboarding?
es: ¿Reiniciar introducción?
fr: Réinitialiser l'introduction ?
pt: Reiniciar introdução?
